# ============================================================
# Clock principal
# ============================================================

# 2 ns -> 500 MHz
create_clock -name clk -period 2 [get_ports clk]

# Incerteza do clock
set_clock_uncertainty 0.1 [get_clocks clk]

# ============================================================
# Input delay
# ============================================================
set_input_delay 1.0 -clock clk [remove_from_collection [all_inputs] [get_ports clk]]

# ============================================================
# Output delay
# ============================================================
set_output_delay 1.0 -clock clk [all_outputs]

# ============================================================
# Fanout máximo
# ============================================================
set_max_fanout 8 [current_design]

# ============================================================
# Carga das saídas
# ============================================================
set_load 0.05 [all_outputs]
